'use strict';
/*
Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе говоря, умножает x на себя n раз и возвращает результат.

pow(3, 2) = 3 * 3 = 9
pow(3, 3) = 3 * 3 * 3 = 27
pow(1, 100) = 1 * 1 * ...* 1 = 1
Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).

P.S. В этой задаче функция обязана поддерживать только натуральные значения n, т.е. целые от 1 и выше.
*/
function pow (x,n) {
  return x**n;
}

let x=+prompt('Введите число X=','');
let n=+prompt('Введите степень N=','');

if (n%1!=0) {
  alert (`Степень ${n} не поддерживается, введите целую степень`);
} else alert (pow(x,n));